"""Создать класс Point2D. Координаты точки задаются 2 параметрами - координатами x, y на плоскости.
Реализовать метод distance который принимает экземпляр класса Point2D и рассчитывает расстояние между 2мя точками
на плоскости.
Создать защищенный атрибут класса - счетчик созданных экземпляров класса.
Чтение количества экземпляров реализовать через метод getter.
Создать класс Point3D, который является наследником класса Point2D. Координаты точки задаются 3 параметрами -
координатами x, y, z в пространстве.
Переопределить конструктор с помощью super().
Переопределить метод distance для определения расстояния между 2-мя точками в пространстве."""


class Point2D:
    pass
